; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=330, out_folder=./training, instance_id=70, seed=2094, goal_proportion=0.03

(define (problem blocksworld-70)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 - object)
 (:init 
    (arm-empty)
    (clear b3)
    (on-table b3)
    (clear b147)
    (on b147 b74)
    (on b74 b124)
    (on b124 b90)
    (on b90 b196)
    (on b196 b234)
    (on b234 b6)
    (on-table b6)
    (clear b215)
    (on b215 b177)
    (on b177 b48)
    (on b48 b125)
    (on-table b125)
    (clear b230)
    (on b230 b142)
    (on b142 b290)
    (on-table b290)
    (clear b275)
    (on-table b275)
    (clear b185)
    (on b185 b192)
    (on-table b192)
    (clear b15)
    (on b15 b57)
    (on b57 b52)
    (on b52 b257)
    (on-table b257)
    (clear b312)
    (on b312 b149)
    (on-table b149)
    (clear b330)
    (on b330 b151)
    (on b151 b71)
    (on b71 b12)
    (on-table b12)
    (clear b233)
    (on-table b233)
    (clear b143)
    (on b143 b38)
    (on b38 b262)
    (on b262 b236)
    (on b236 b79)
    (on b79 b150)
    (on b150 b37)
    (on b37 b223)
    (on-table b223)
    (clear b194)
    (on b194 b296)
    (on b296 b313)
    (on-table b313)
    (clear b243)
    (on b243 b43)
    (on b43 b273)
    (on b273 b286)
    (on b286 b21)
    (on b21 b25)
    (on b25 b224)
    (on b224 b75)
    (on b75 b287)
    (on-table b287)
    (clear b324)
    (on b324 b114)
    (on b114 b281)
    (on b281 b174)
    (on b174 b91)
    (on b91 b20)
    (on-table b20)
    (clear b111)
    (on b111 b219)
    (on b219 b128)
    (on b128 b279)
    (on b279 b162)
    (on b162 b86)
    (on b86 b255)
    (on-table b255)
    (clear b18)
    (on b18 b133)
    (on b133 b269)
    (on b269 b225)
    (on-table b225)
    (clear b280)
    (on b280 b176)
    (on b176 b28)
    (on b28 b89)
    (on b89 b227)
    (on b227 b285)
    (on b285 b217)
    (on-table b217)
    (clear b186)
    (on b186 b246)
    (on b246 b326)
    (on b326 b56)
    (on b56 b138)
    (on b138 b239)
    (on b239 b10)
    (on-table b10)
    (clear b242)
    (on b242 b306)
    (on-table b306)
    (clear b102)
    (on b102 b99)
    (on b99 b258)
    (on-table b258)
    (clear b78)
    (on b78 b206)
    (on-table b206)
    (clear b260)
    (on b260 b168)
    (on-table b168)
    (clear b35)
    (on-table b35)
    (clear b172)
    (on-table b172)
    (clear b157)
    (on b157 b16)
    (on b16 b65)
    (on b65 b87)
    (on b87 b55)
    (on b55 b222)
    (on b222 b93)
    (on b93 b81)
    (on b81 b9)
    (on-table b9)
    (clear b95)
    (on b95 b166)
    (on-table b166)
    (clear b327)
    (on b327 b304)
    (on-table b304)
    (clear b205)
    (on b205 b294)
    (on b294 b238)
    (on b238 b253)
    (on b253 b229)
    (on-table b229)
    (clear b293)
    (on b293 b63)
    (on b63 b32)
    (on b32 b226)
    (on b226 b64)
    (on-table b64)
    (clear b213)
    (on-table b213)
    (clear b44)
    (on-table b44)
    (clear b316)
    (on b316 b68)
    (on-table b68)
    (clear b268)
    (on b268 b14)
    (on b14 b121)
    (on b121 b235)
    (on-table b235)
    (clear b209)
    (on b209 b201)
    (on b201 b249)
    (on b249 b85)
    (on b85 b76)
    (on-table b76)
    (clear b310)
    (on b310 b113)
    (on b113 b175)
    (on b175 b137)
    (on b137 b318)
    (on b318 b208)
    (on b208 b29)
    (on-table b29)
    (clear b179)
    (on-table b179)
    (clear b115)
    (on b115 b122)
    (on-table b122)
    (clear b135)
    (on b135 b23)
    (on b23 b51)
    (on b51 b247)
    (on-table b247)
    (clear b109)
    (on-table b109)
    (clear b167)
    (on-table b167)
    (clear b120)
    (on b120 b42)
    (on b42 b77)
    (on b77 b195)
    (on b195 b256)
    (on b256 b132)
    (on b132 b17)
    (on b17 b198)
    (on-table b198)
    (clear b180)
    (on b180 b108)
    (on-table b108)
    (clear b105)
    (on-table b105)
    (clear b308)
    (on b308 b232)
    (on b232 b276)
    (on b276 b146)
    (on b146 b34)
    (on b34 b323)
    (on-table b323)
    (clear b101)
    (on b101 b58)
    (on b58 b66)
    (on b66 b320)
    (on b320 b127)
    (on-table b127)
    (clear b220)
    (on b220 b211)
    (on b211 b301)
    (on b301 b298)
    (on b298 b228)
    (on b228 b303)
    (on b303 b61)
    (on b61 b106)
    (on-table b106)
    (clear b251)
    (on b251 b322)
    (on b322 b119)
    (on b119 b116)
    (on b116 b82)
    (on b82 b49)
    (on b49 b278)
    (on b278 b311)
    (on b311 b237)
    (on-table b237)
    (clear b169)
    (on b169 b163)
    (on b163 b145)
    (on b145 b199)
    (on b199 b283)
    (on-table b283)
    (clear b53)
    (on b53 b62)
    (on-table b62)
    (clear b295)
    (on b295 b184)
    (on-table b184)
    (clear b164)
    (on-table b164)
    (clear b189)
    (on b189 b45)
    (on b45 b231)
    (on b231 b272)
    (on b272 b126)
    (on b126 b118)
    (on-table b118)
    (clear b214)
    (on b214 b104)
    (on b104 b284)
    (on b284 b202)
    (on b202 b265)
    (on b265 b98)
    (on b98 b140)
    (on b140 b297)
    (on b297 b181)
    (on b181 b250)
    (on b250 b188)
    (on b188 b315)
    (on b315 b267)
    (on-table b267)
    (clear b171)
    (on b171 b112)
    (on b112 b319)
    (on b319 b241)
    (on b241 b305)
    (on b305 b210)
    (on-table b210)
    (clear b221)
    (on b221 b328)
    (on b328 b31)
    (on b31 b325)
    (on-table b325)
    (clear b70)
    (on b70 b117)
    (on b117 b13)
    (on b13 b83)
    (on-table b83)
    (clear b110)
    (on b110 b244)
    (on-table b244)
    (clear b148)
    (on b148 b40)
    (on-table b40)
    (clear b160)
    (on b160 b204)
    (on b204 b39)
    (on b39 b30)
    (on b30 b282)
    (on b282 b100)
    (on-table b100)
    (clear b33)
    (on b33 b60)
    (on-table b60)
    (clear b218)
    (on-table b218)
    (clear b54)
    (on-table b54)
    (clear b97)
    (on b97 b288)
    (on b288 b182)
    (on b182 b26)
    (on b26 b5)
    (on b5 b103)
    (on b103 b50)
    (on b50 b96)
    (on b96 b130)
    (on b130 b47)
    (on-table b47)
    (clear b2)
    (on b2 b266)
    (on b266 b245)
    (on-table b245)
    (clear b152)
    (on b152 b107)
    (on-table b107)
    (clear b178)
    (on b178 b190)
    (on b190 b1)
    (on-table b1)
    (clear b270)
    (on-table b270)
    (clear b274)
    (on b274 b263)
    (on b263 b170)
    (on b170 b129)
    (on-table b129)
    (clear b69)
    (on b69 b197)
    (on b197 b80)
    (on b80 b207)
    (on-table b207)
    (clear b139)
    (on b139 b8)
    (on b8 b46)
    (on b46 b314)
    (on b314 b289)
    (on b289 b159)
    (on b159 b309)
    (on b309 b216)
    (on b216 b84)
    (on b84 b59)
    (on b59 b264)
    (on b264 b67)
    (on b67 b141)
    (on b141 b153)
    (on b153 b187)
    (on-table b187)
    (clear b173)
    (on b173 b131)
    (on b131 b240)
    (on b240 b156)
    (on-table b156)
    (clear b259)
    (on b259 b24)
    (on-table b24)
    (clear b212)
    (on-table b212)
    (clear b22)
    (on b22 b292)
    (on b292 b300)
    (on-table b300)
    (clear b200)
    (on b200 b134)
    (on b134 b4)
    (on b4 b317)
    (on b317 b277)
    (on b277 b11)
    (on b11 b36)
    (on-table b36)
    (clear b155)
    (on b155 b72)
    (on b72 b73)
    (on b73 b252)
    (on b252 b271)
    (on b271 b193)
    (on b193 b136)
    (on b136 b161)
    (on b161 b92)
    (on-table b92)
    (clear b158)
    (on-table b158)
    (clear b254)
    (on b254 b261)
    (on b261 b307)
    (on b307 b144)
    (on b144 b165)
    (on b165 b19)
    (on-table b19)
    (clear b299)
    (on-table b299)
    (clear b88)
    (on b88 b321)
    (on b321 b123)
    (on b123 b248)
    (on b248 b329)
    (on b329 b183)
    (on b183 b41)
    (on-table b41)
    (clear b291)
    (on-table b291)
    (clear b191)
    (on b191 b302)
    (on-table b302)
    (clear b94)
    (on b94 b203)
    (on b203 b7)
    (on b7 b154)
    (on b154 b27)
    (on-table b27))
 (:goal  (and 
    (clear b5)
    (on b5 b2)
    (on b2 b1)
    (on-table b1)
    (clear b3)
    (on-table b3)
    (clear b4)
    (on b4 b9)
    (on b9 b6)
    (on b6 b7)
    (on b7 b8)
    (on-table b8))))

; plan
1. (unstack b139 b8)
   deleted: (on b139 b8) (clear b139) (arm-empty)
   added: (holding b139) (clear b8)
   goals met: 3 of 12
2. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 3 of 12
3. (unstack b8 b46)
   deleted: (on b8 b46) (clear b8) (arm-empty)
   added: (holding b8) (clear b46)
   goals met: 3 of 12
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 12
5. (unstack b147 b74)
   deleted: (on b147 b74) (clear b147) (arm-empty)
   added: (holding b147) (clear b74)
   goals met: 4 of 12
6. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 4 of 12
7. (unstack b157 b16)
   deleted: (on b157 b16) (clear b157) (arm-empty)
   added: (holding b157) (clear b16)
   goals met: 4 of 12
8. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 4 of 12
9. (unstack b16 b65)
   deleted: (on b16 b65) (clear b16) (arm-empty)
   added: (holding b16) (clear b65)
   goals met: 4 of 12
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 12
11. (unstack b178 b190)
   deleted: (on b178 b190) (clear b178) (arm-empty)
   added: (holding b178) (clear b190)
   goals met: 4 of 12
12. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 4 of 12
13. (unstack b190 b1)
   deleted: (on b190 b1) (clear b190) (arm-empty)
   added: (holding b190) (clear b1)
   goals met: 4 of 12
14. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 4 of 12
15. (unstack b200 b134)
   deleted: (on b200 b134) (clear b200) (arm-empty)
   added: (holding b200) (clear b134)
   goals met: 4 of 12
16. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 4 of 12
17. (unstack b134 b4)
   deleted: (on b134 b4) (clear b134) (arm-empty)
   added: (holding b134) (clear b4)
   goals met: 5 of 12
18. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 5 of 12
19. (unstack b65 b87)
   deleted: (on b65 b87) (clear b65) (arm-empty)
   added: (holding b65) (clear b87)
   goals met: 5 of 12
20. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 5 of 12
21. (unstack b74 b124)
   deleted: (on b74 b124) (clear b74) (arm-empty)
   added: (holding b74) (clear b124)
   goals met: 5 of 12
22. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 5 of 12
23. (unstack b124 b90)
   deleted: (on b124 b90) (clear b124) (arm-empty)
   added: (holding b124) (clear b90)
   goals met: 5 of 12
24. (putdown b124)
   deleted: (holding b124)
   added: (clear b124) (arm-empty) (on-table b124)
   goals met: 5 of 12
25. (unstack b87 b55)
   deleted: (on b87 b55) (clear b87) (arm-empty)
   added: (holding b87) (clear b55)
   goals met: 5 of 12
26. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 5 of 12
27. (unstack b55 b222)
   deleted: (on b55 b222) (clear b55) (arm-empty)
   added: (holding b55) (clear b222)
   goals met: 5 of 12
28. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 12
29. (unstack b222 b93)
   deleted: (on b222 b93) (clear b222) (arm-empty)
   added: (holding b222) (clear b93)
   goals met: 5 of 12
30. (putdown b222)
   deleted: (holding b222)
   added: (clear b222) (arm-empty) (on-table b222)
   goals met: 5 of 12
31. (unstack b90 b196)
   deleted: (on b90 b196) (clear b90) (arm-empty)
   added: (holding b90) (clear b196)
   goals met: 5 of 12
32. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 5 of 12
33. (unstack b196 b234)
   deleted: (on b196 b234) (clear b196) (arm-empty)
   added: (holding b196) (clear b234)
   goals met: 5 of 12
34. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 5 of 12
35. (unstack b234 b6)
   deleted: (on b234 b6) (clear b234) (arm-empty)
   added: (holding b234) (clear b6)
   goals met: 5 of 12
36. (putdown b234)
   deleted: (holding b234)
   added: (clear b234) (arm-empty) (on-table b234)
   goals met: 5 of 12
37. (unstack b93 b81)
   deleted: (on b93 b81) (clear b93) (arm-empty)
   added: (holding b93) (clear b81)
   goals met: 5 of 12
38. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 5 of 12
39. (unstack b81 b9)
   deleted: (on b81 b9) (clear b81) (arm-empty)
   added: (holding b81) (clear b9)
   goals met: 5 of 12
40. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 12
41. (unstack b94 b203)
   deleted: (on b94 b203) (clear b94) (arm-empty)
   added: (holding b94) (clear b203)
   goals met: 5 of 12
42. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 5 of 12
43. (unstack b203 b7)
   deleted: (on b203 b7) (clear b203) (arm-empty)
   added: (holding b203) (clear b7)
   goals met: 5 of 12
44. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 5 of 12
45. (unstack b97 b288)
   deleted: (on b97 b288) (clear b97) (arm-empty)
   added: (holding b97) (clear b288)
   goals met: 5 of 12
46. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 5 of 12
47. (unstack b288 b182)
   deleted: (on b288 b182) (clear b288) (arm-empty)
   added: (holding b288) (clear b182)
   goals met: 5 of 12
48. (putdown b288)
   deleted: (holding b288)
   added: (clear b288) (arm-empty) (on-table b288)
   goals met: 5 of 12
49. (unstack b182 b26)
   deleted: (on b182 b26) (clear b182) (arm-empty)
   added: (holding b182) (clear b26)
   goals met: 5 of 12
50. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 5 of 12
51. (unstack b26 b5)
   deleted: (on b26 b5) (clear b26) (arm-empty)
   added: (holding b26) (clear b5)
   goals met: 6 of 12
52. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 6 of 12
53. (unstack b2 b266)
   deleted: (on b2 b266) (clear b2) (arm-empty)
   added: (holding b2) (clear b266)
   goals met: 6 of 12
54. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 12
55. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 12
56. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 8 of 12
57. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 8 of 12
58. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 9 of 12
59. (unstack b4 b317)
   deleted: (on b4 b317) (clear b4) (arm-empty)
   added: (holding b4) (clear b317)
   goals met: 8 of 12
60. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 10 of 12
61. (unstack b5 b103)
   deleted: (on b5 b103) (clear b5) (arm-empty)
   added: (holding b5) (clear b103)
   goals met: 9 of 12
62. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 11 of 12
63. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 9 of 12
64. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 12
65. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 9 of 12
66. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 12
67. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 12
68. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 10 of 12
69. (unstack b6 b7)
   deleted: (on b6 b7) (clear b6) (arm-empty)
   added: (holding b6) (clear b7)
   goals met: 9 of 12
70. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 9 of 12
71. (unstack b7 b154)
   deleted: (on b7 b154) (clear b7) (arm-empty)
   added: (holding b7) (clear b154)
   goals met: 9 of 12
72. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 10 of 12
73. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 12
74. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 11 of 12
75. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 9 of 12
76. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 12
77. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 12
78. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 11 of 12
79. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 12
80. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 12 of 12
